Repository: SumPositive/Calclin
Catalog: Calclin/Resources/Localizable.xcstrings
Source language: ja
Languages: en

# calc.baseUnit.usedFormat
source: 基準単位[%@] で計算しました
en: Used base unit [%@]

# calc.unit.convertList
source: 換算リスト
en: Conversions

# calc.unit.swapHint
source: 単位だけを変えました。同じ単位キーをもう一度押すと換算します。入力行の単位を押すと換算リストを表示します
en: Only the unit changed. Tap the same unit key again to convert the value. Tap the unit in the input row to see the conversion list.

# calc.quote.unitMismatch
source: 基準単位が違うため引用できません
en: Different base unit, can’t add

# calc.unit.cannotConvert
source: 基準単位が違うため換算できません
en: Different base unit, can’t convert

# calc.error.divideByZero
source: ÷0エラー
en: Div by 0

# calc.error.negativeSqrt
source: 負の数の√は計算できません
en: No √ for negatives

# calc.mode.calculator.hint
source: 電卓：入力した順に計算します 5＋5×2＝20
en: Calc: adds up in the order you enter. 5+5×2 = 20

# calc.mode.formula.hint
source: 数式：×と÷を先に計算します 5＋5×2＝15
en: Formula: × and ÷ come first. 5+5×2 = 15

# calc.mode.calculator
source: 電卓
en: Calc

# calc.mode.formula
source: 数式
en: Formula

# calc.pdf.generating
source: PDF作成中…
en: Making PDF…

# calc.result.error
source: エラー
en: Error

# calc.result.noData
source: データなし
en: No data

# calc.result.tooLong
source: 長すぎます
en: Too long

# calc.share.title.calculator
source: Calclin（電卓）
en: Calclin (Calc)

# calc.share.title.formula
source: Calclin（数式）
en: Calclin (Formula)

# calcFrame.decrease
source: 計算機(枠)の表示を減らす
en: Fewer frames

# calcFrame.increase
source: 計算機(枠)の表示を増やす
en: More frames

# calcFrame.switchHint
source: 左右にスワイプまたは 枠内をタップして切り替え ダブルタップも有効です
en: Swipe or tap to switch Double-tap works too

# common.close
source: 閉じる
en: Close

# common.loading
source: 読み込み中...
en: Loading...

# common.memo
source: メモ
en: Note

# common.notice
source: お知らせ
en: Notice

# common.color
source: 入力行の色
en: Input row color

# common.function
source: 機能
en: Functions

# common.font
source: 入力数字フォント
en: Input number font

# common.start
source: 開始
en: Start

# common.pdf
source: ロールをPDFで出力
en: Export roll as PDF

# common.save
source: 保存
en: Save

# history.formulaHint
source: 数式の行をスワイプすればメモしたり、式をコピーできます
en: Swipe row for note/copy

# history.rollHint
source: 明細行をタップすれば編集できます。=行はメモ入力できます
en: Tap row to edit. = for note

# info.url
source: https://docs.azukid.com/jp/sumpo/Calclin/calclin
en: https://docs.azukid.com/en/sumpo/Calclin/calclin

# keyboard.baseUnit
source: 基準単位
en: Base unit

# keyboard.baseUnitHelp
source: 基準単位のcodeを記入。基準単位が同じ単位の範囲で加減算や変換が可能
en: Code for shared unit math

# keyboard.changeDefinition
source: キー定義を変更
en: Change key

# keyboard.code
source: コード
en: Code

# keyboard.conversionRate
source: 変換倍率
en: Rate

# keyboard.conversionRateHelp
source: 基準単位にするための倍率。自身が基準単位ならば空白
en: Multiplier to base unit

# keyboard.editor.title
source: キー定義編集 （危険！Hacker Zone） 壊れたら再インストールしてね
en: Key Editor Hacker Zone Reinstall if broken

# keyboard.export
source: エクスポート
en: Export

# keyboard.exportFailure
source: エクスポートに失敗しました
en: Export failed

# keyboard.exportHelp
source: JSONファイルに書き出す
en: Write JSON

# keyboard.formula
source: 数式
en: Formula

# keyboard.formulaHelp
source: 計算式に使われる文字や記号
en: Used in formulas

# keyboard.import
source: インポート
en: Import

# keyboard.importFailure
source: インポートに失敗しました
en: Import failed

# keyboard.importHelp
source: JSONファイルから読み込む
en: Read JSON

# keyboard.importSuccess
source: インポートしました
en: Imported

# keyboard.keyTop
source: キートップ
en: Key top

# keyboard.keyTopHelp
source: キーボード上に表示される文字や記号
en: Shown on keyboard

# settings.keyShape
source: キー形状
en: Key shape

# settings.keyShape.circle
source: 円
en: Round

# settings.keyShape.custom
source: カスタム
en: Custom

# settings.keyShape.default
source: デフォルト
en: Default

# settings.keyBrightness
source: 明るさ
en: Brightness

# settings.keyDepth
source: 立体感
en: Depth

# settings.keyHighlight
source: ハイライト
en: Highlight

# settings.keyShadow
source: 影
en: Shadow

# settings.keyShape.square
source: 四角
en: Square

# keyboard.layout
source: キーボード配置
en: Keyboard

# keyboard.replaceTapped
source: タップしたキーに置き換わります 【達人限定】さらに長押しで定義の編集ができます
en: Uses tapped key Expert: long-press to edit

# keyboard.replaceUndefined
source: キーが空欄・未定義に置き換わります
en: Key becomes blank

# keyboard.reset
source: 初期化
en: Reset

# keyboard.resetFailure
source: 初期化に失敗しました
en: Reset failed

# keyboard.resetHelp
source: 初期のキー定義と配置に戻す
en: Back to defaults

# keyboard.resetSuccess
source: 初期の配置に戻しました
en: Default layout restored

# keyboard.restore
source: 復元
en: Restore

# keyboard.restoreFailure
source: 復元に失敗しました
en: Restore failed

# keyboard.saveCurrent
source: 現在の配置を保存する
en: Save layout

# keyboard.saved
source: 保存しました
en: Saved

# keyboard.savedRestore
source: 保存した配置に戻す
en: Restore saved layout

# keyboard.savedRestored
source: 保存した配置に戻しました
en: Saved layout restored

# keyboard.saveFailure
source: 保存に失敗しました
en: Save failed

# keyboard.switchHint
source: 左右にスワイプすればキーボードが切り替わります キーを長押しすればキー定義を変更できます
en: Swipe to switch keyboards Long-press to edit keys

# keyboard.symbol
source: 記号
en: Symbol

# keyboard.symbolHelp
source: Apple SF Symbols name
en: SF Symbols name

# settings.appearance.auto
source: 自動
en: Auto

# settings.appearance.dark
source: ダーク
en: Dark

# settings.appearance.light
source: ライト
en: Light

# settings.accent
source: 入力行の色
en: Input row color

# settings.accent.standard
source: アクセント
en: Accent

# settings.accent.teal
source: ディープティール
en: Deep Teal

# settings.accent.indigo
source: 藍
en: Indigo

# settings.accent.bronze
source: ブロンズ
en: Bronze

# settings.accent.graphite
source: グラファイト
en: Graphite

# settings.appearanceMode
source: 外観モード
en: Look

# settings.autoScroll
source: 最新行を表示するタイミング
en: Show latest row

# settings.autoScroll.recommended
source: おすすめ
en: Recommended

# settings.autoScroll.off
source: しない
en: Off

# settings.autoScroll.onInput
source: 入力時
en: On input

# settings.autoScroll.onTotal
source: ＝合計時
en: On total

# settings.decimalDigits
source: 有効桁数
en: Digits

# settings.decimalPoint
source: 小数点
en: Decimal point

# settings.displayMode
source: 表示モード
en: Display

# settings.displayMode.beginner
source: 初心者
en: Beginner

# settings.displayMode.expert
source: 達人
en: Expert

# settings.grouping.four
source: ４桁区切り 1,2345,6789.0
en: 4-digit 1,2345,6789.0

# settings.grouping.indian
source: インド式 12,34,56,789.0
en: Indian 12,34,56,789.0

# settings.grouping.none
source: 区切りなし 123456789.0
en: None 123456789.0

# settings.grouping.three
source: ３桁区切り 123,456,789.0
en: 3-digit 123,456,789.0

# settings.groupingStyle
source: 桁区切り方式
en: Grouping

# settings.groupingSymbol
source: 桁区切り記号
en: Separator

# settings.open
source: 設定を開く
en: Settings

# settings.round.down
source: 切り捨て
en: Round down

# settings.round.halfDown
source: 五捨六入
en: Half down

# settings.round.halfEven
source: 五捨五超入 偶数丸め
en: Half even

# settings.round.halfUp
source: 四捨五入
en: Half up

# settings.round.minus
source: 負方向丸め
en: Toward -

# settings.round.plus
source: 正方向丸め
en: Toward +

# settings.round.up
source: 切り上げ
en: Round up

# settings.rounding
source: 丸め処理
en: Rounding

# settings.section.decimal
source: 小数部
en: Decimal

# settings.section.display
source: 表示
en: Display

# settings.section.integer
source: 整数部
en: Integer

# settings.title
source: 設定
en: Settings

# settings.userGuide
source: 取扱説明
en: User guide

# settings.rateApp
source: アプリを評価する
en: Rate This App

# settings.rateApp.description
source: ご要望やご提案もぜひお聞かせください。今後の新機能や改善を検討する際の参考にさせていただきます
en: We’d love to hear your requests and suggestions. They help us decide which new features and improvements to work on next.

# settings.fontScale
source: 文字サイズ
en: Font Size

# settings.numberFont.title
source: 入力数字フォント
en: Input number font

# settings.numberFont
source: 数字フォント
en: Number Font

# settings.help.numberFont
source: 入力行に適用されます。入力行の右側を長押しでも変更できます
en: Applies to the input row. You can also change it by long-pressing the right side of the input row.

# settings.fontScale.system
source: 自動
en: Auto

# settings.fontScale.standard
source: 標準
en: Standard

# settings.fontScale.large
source: 大
en: Large

# settings.fontScale.xLarge
source: 特大
en: Extra Large

# settings.help.autoScroll
source: ロールの最新行を自動的に表示するタイミングを設定できます。おすすめは、数式モードは[=]のとき、電卓モードは[=]と演算子のときです
en: Choose when the roll jumps to the latest row. Recommended: on [=], plus after an operator in calculator mode.

# settings.help.fontScale
source: 自動にすれば、システム設定した文字サイズの拡大などが反映されます
en: Auto follows your iOS text size settings.

# settings.zoomLevel
source: 表示倍率
en: Scale

# support.ad
source: 広告を見て応援する
en: Watch ad

# support.ad.closeHint
source: 最後に閉じる(X)ボタンが現れます
en: Close (X) appears at the end.

# support.ad.description
source: 動画を最後まで視聴すると開発者に寄付できます
en: Watch to the end to support us.

# support.ad.play
source: 動画を再生する
en: Play video

# support.ad.prompt
source: タップして広告を見て開発者を応援してください
en: Watch an ad to support us.

# support.ad.soundWarning
source: 音が出ます
en: Sound on

# support.ad.thanks
source: 視聴ありがとうございます！開発の支援になります。
en: Thanks for watching. It helps.

# support.ad.unavailable
source: 現在、寄付できる広告がありません。後ほどお試しください
en: No support ads now. Try later.

# support.ad.videoTitle
source: 寄付できる動画広告
en: Support video

# support.section
source: 開発者を応援
en: Support

# support.thanks.message
source: 応援いただきありがとうございます。これからも改善を続けてまいります！
en: Thanks for your support. We will keep improving.

# support.thanks.title
source: ありがとうございます！
en: Thank you!

# support.tip
source: 投げ銭で応援する
en: Send a tip

# support.tip.message
source: このアプリの開発を応援していただけると励みになります。
en: Your support helps us improve.

# support.unavailable
source: 現在ご利用いただけません。
en: Not available now.
